GopalSaraf/Practicals/PSDL/include/proc/pic16f18076.h
// Register: CK1PPS
#define CK1PPS CK1PPS
extern volatile unsigned char           CK1PPS              __at(0x1E42);
#ifndef _LIB_BUILD
asm("CK1PPS equ 01E42h");
#endif
// aliases
extern volatile unsigned char           RX1DTPPS            __at(0x1E42);
#ifndef _LIB_BUILD
asm("RX1DTPPS equ 01E42h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CK1PPS                 :6;
    };
} CK1PPSbits_t;
extern volatile CK1PPSbits_t CK1PPSbits __at(0x1E42);
// bitfield macros
#define _CK1PPS_CK1PPS_POSN                                 0x0
#define _CK1PPS_CK1PPS_POSITION                             0x0
#define _CK1PPS_CK1PPS_SIZE                                 0x6
#define _CK1PPS_CK1PPS_LENGTH                               0x6
#define _CK1PPS_CK1PPS_MASK                                 0x3F
// alias bitfield definitions
typedef union {
    struct {
        unsigned CK1PPS                 :6;
    };
} RX1DTPPSbits_t;
extern volatile RX1DTPPSbits_t RX1DTPPSbits __at(0x1E42);
// bitfield macros
#define _RX1DTPPS_CK1PPS_POSN                               0x0
#define _RX1DTPPS_CK1PPS_POSITION                           0x0
#define _RX1DTPPS_CK1PPS_SIZE                               0x6
#define _RX1DTPPS_CK1PPS_LENGTH                             0x6
#define _RX1DTPPS_CK1PPS_MASK                               0x3F

// Register: RX2PPS
#define RX2PPS RX2PPS
extern volatile unsigned char           RX2PPS              __at(0x1E43);
#ifndef _LIB_BUILD
asm("RX2PPS equ 01E43h");
#endif
// aliases
extern volatile unsigned char           TX2CKPPS            __at(0x1E43);
#ifndef _LIB_BUILD
asm("TX2CKPPS equ 01E43h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RX2PPS                 :6;
    };
} RX2PPSbits_t;
extern volatile RX2PPSbits_t RX2PPSbits __at(0x1E43);
// bitfield macros
#define _RX2PPS_RX2PPS_POSN                                 0x0
#define _RX2PPS_RX2PPS_POSITION                             0x0
#define _RX2PPS_RX2PPS_SIZE                                 0x6
#define _RX2PPS_RX2PPS_LENGTH                               0x6
#define _RX2PPS_RX2PPS_MASK                                 0x3F
// alias bitfield definitions
typedef union {
    struct {
        unsigned RX2PPS                 :6;
    };
} TX2CKPPSbits_t;
extern volatile TX2CKPPSbits_t TX2CKPPSbits __at(0x1E43);
// bitfield macros
#define _TX2CKPPS_RX2PPS_POSN                               0x0
#define _TX2CKPPS_RX2PPS_POSITION                           0x0
#define _TX2CKPPS_RX2PPS_SIZE                               0x6
#define _TX2CKPPS_RX2PPS_LENGTH                             0x6
#define _TX2CKPPS_RX2PPS_MASK                               0x3F

// Register: CK2PPS
#define CK2PPS CK2PPS
extern volatile unsigned char           CK2PPS              __at(0x1E44);
#ifndef _LIB_BUILD
asm("CK2PPS equ 01E44h");
#endif
// aliases
extern volatile unsigned char           RX2DTPPS            __at(0x1E44);
#ifndef _LIB_BUILD
asm("RX2DTPPS equ 01E44h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CK2PPS                 :6;
    };
} CK2PPSbits_t;
extern volatile CK2PPSbits_t CK2PPSbits __at(0x1E44);
// bitfield macros
#define _CK2PPS_CK2PPS_POSN                                 0x0
#define _CK2PPS_CK2PPS_POSITION                             0x0
#define _CK2PPS_CK2PPS_SIZE                                 0x6
#define _CK2PPS_CK2PPS_LENGTH                               0x6
#define _CK2PPS_CK2PPS_MASK                                 0x3F
// alias bitfield definitions
typedef union {
    struct {
        unsigned CK2PPS                 :6;
    };
} RX2DTPPSbits_t;
extern volatile RX2DTPPSbits_t RX2DTPPSbits __at(0x1E44);
// bitfield macros
#define _RX2DTPPS_CK2PPS_POSN                               0x0
#define _RX2DTPPS_CK2PPS_POSITION                           0x0
#define _RX2DTPPS_CK2PPS_SIZE                               0x6
#define _RX2DTPPS_CK2PPS_LENGTH                             0x6
#define _RX2DTPPS_CK2PPS_MASK                               0x3F

// Register: SSP1CLKPPS
#define SSP1CLKPPS SSP1CLKPPS
extern volatile unsigned char           SSP1CLKPPS          __at(0x1E47);
#ifndef _LIB_BUILD
asm("SSP1CLKPPS equ 01E47h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSP1CLKPPS             :6;
    };
    struct {
        unsigned SSP1CLKPPS0            :1;
        unsigned SSP1CLKPPS1            :1;
        unsigned SSP1CLKPPS2            :1;
        unsigned SSP1CLKPPS3            :1;
        unsigned SSP1CLKPPS4            :1;
        unsigned SSP1CLKPPS5            :1;
    };
} SSP1CLKPPSbits_t;
extern volatile SSP1CLKPPSbits_t SSP1CLKPPSbits __at(0x1E47);
// bitfield macros
#define _SSP1CLKPPS_SSP1CLKPPS_POSN                         0x0
#define _SSP1CLKPPS_SSP1CLKPPS_POSITION                     0x0
#define _SSP1CLKPPS_SSP1CLKPPS_SIZE                         0x6
#define _SSP1CLKPPS_SSP1CLKPPS_LENGTH                       0x6
#define _SSP1CLKPPS_SSP1CLKPPS_MASK                         0x3F
#define _SSP1CLKPPS_SSP1CLKPPS0_POSN                        0x0
#define _SSP1CLKPPS_SSP1CLKPPS0_POSITION                    0x0
#define _SSP1CLKPPS_SSP1CLKPPS0_SIZE                        0x1
#define _SSP1CLKPPS_SSP1CLKPPS0_LENGTH                      0x1
#define _SSP1CLKPPS_SSP1CLKPPS0_MASK                        0x1
#define _SSP1CLKPPS_SSP1CLKPPS1_POSN                        0x1
#define _SSP1CLKPPS_SSP1CLKPPS1_POSITION                    0x1
#define _SSP1CLKPPS_SSP1CLKPPS1_SIZE                        0x1
#define _SSP1CLKPPS_SSP1CLKPPS1_LENGTH                      0x1
#define _SSP1CLKPPS_SSP1CLKPPS1_MASK                        0x2
#define _SSP1CLKPPS_SSP1CLKPPS2_POSN                        0x2
#define _SSP1CLKPPS_SSP1CLKPPS2_POSITION                    0x2
#define _SSP1CLKPPS_SSP1CLKPPS2_SIZE                        0x1
#define _SSP1CLKPPS_SSP1CLKPPS2_LENGTH                      0x1
#define _SSP1CLKPPS_SSP1CLKPPS2_MASK                        0x4
#define _SSP1CLKPPS_SSP1CLKPPS3_POSN                        0x3
#define _SSP1CLKPPS_SSP1CLKPPS3_POSITION                    0x3
#define _SSP1CLKPPS_SSP1CLKPPS3_SIZE                        0x1
#define _SSP1CLKPPS_SSP1CLKPPS3_LENGTH                      0x1
#define _SSP1CLKPPS_SSP1CLKPPS3_MASK                        0x8
#define _SSP1CLKPPS_SSP1CLKPPS4_POSN                        0x4
#define _SSP1CLKPPS_SSP1CLKPPS4_POSITION                    0x4
#define _SSP1CLKPPS_SSP1CLKPPS4_SIZE                        0x1
#define _SSP1CLKPPS_SSP1CLKPPS4_LENGTH                      0x1
#define _SSP1CLKPPS_SSP1CLKPPS4_MASK                        0x10
#define _SSP1CLKPPS_SSP1CLKPPS5_POSN                        0x5
#define _SSP1CLKPPS_SSP1CLKPPS5_POSITION                    0x5
#define _SSP1CLKPPS_SSP1CLKPPS5_SIZE                        0x1
#define _SSP1CLKPPS_SSP1CLKPPS5_LENGTH                      0x1
#define _SSP1CLKPPS_SSP1CLKPPS5_MASK                        0x20

